# --------------------------------------MENU--------------------------------------
startMessage = \
"""
Я — телеграм бот организации <b>Masa Israel</b>, которая за 19 лет существования уже помогла более <i>180 000</i> участникам из более чем <i>60</i> разных стран отправиться в <b>своё собственное путешествие в Израиле</b> 🛫 

Мы хотим, чтобы <b>каждый еврейский юноша или девушка</b> имели возможность приобрести значимый трансформативный опыт жизни в Израиле.

<b>Здесь ты сможешь</b>
 🧠 Узнать больше о нашей деятельности и условиях участия;
 🔍 Выбрать интересное направление из 60+ программ;
 🤳 Связаться с координатором для прохождения дальнейших этапов.

---
<i>По кнопкам над клавиатурой всегда можно вернуться к главному меню и основным разделам бота.</i>
"""
menuMessage = \
"""
<b>Здесь ты можешь</b>
 🧠 Узнать больше о нашей деятельности и условиях участия;
 🔍 Выбрать интересное направление из 60+ программ;
 🤳 Связаться с координатором для прохождения дальнейших этапов.

---
<i>По кнопкам над клавиатурой всегда можно вернуться к главному меню и основным разделам бота.</i>
"""


# --------------------------------------ABOUT--------------------------------------
aboutMessage = \
"""
<b>О нас</b>

<b>Маса</b> — образовательный проект, который даёт еврейской молодёжи со всего мира принять участие в долгосрочных программах в Израиле, учиться, путешествовать и заводить новых друзей!
Маса создавалась правительством Израиля и Еврейским агентством для того, чтобы ты мог познакомиться с Израилем и приобрести опыт самостоятельной жизни в новой стране.
А чтобы это было максимально доступно, Маса выделяет гранты на участие от 4200$ до 8400$!
Маса — это более 300 международных программ по всему Израилю.
Из них более 60 программ на русском языке длительностью от 4 до 8 месяцев!

<i>Выбери интересующую тебя категорию в меню ниже, чтобы узнать больше о нашей организации</i>
"""

aboutGraduates = \
"""
Ты выпускник Масы или скоро им станешь? Встречай <a href='https://www.masaisrael.org/career-engine/'>Masa Career Engine</a> — карьерную платформу Маса, которая откроет тебе путь к удивительным возможностям! 

Мы очень гордимся тем, что на Масе устанавливаются связи, которые длятся всю жизнь. А Masa Career Engine связывает участников с Израилем и еврейским сообществом — ведь эта платформа создана, чтобы ты мог откликаться на позиции лучших израильских работодателей и еврейских организаций.

Время исследовать, расти и достигать новых высот! Перейди по ссылке, воспользуйся карьерной платформой и найди позицию мечты прямо сейчас.

Также, если ещё не вступил, заходи в чат <a href='https://t.me/masa_community'>Masa Community</a>, где сможешь найти ответ на свой вопрос или же помочь кому-то ещё :)
"""

aboutCommunity = \
"""
Новый репатриант, студент, находишься на программе Маса или только собираешься на неё?

Присоединяйся к чату <a href='https://t.me/masa_community'>Masa Community</a>!

Это весёлое сообщество участников, выпускников и, конечно же, будущих масят.
Опытные ребята с удовольствием ответят на любой твой вопрос и расскажут, что такое классная жизнь в Израиле!
"""

aboutContacts = \
"""
<i>Подпишись на соцсети Масы и стань частью большого комьюнити, говорящего с тобой на одном языке!</i>

Israel phone: +(972)02-621-6581
Russia phone: 810-800-2095-1972
Whatsapp: +(972)52-614-9547
Instagram: https://www.instagram.com/masa_fsu/ 
Facebook: https://www.facebook.com/MasaIsrael.org
VK: https://vk.com/masaisraelrus
Telegram: https://t.me/masa_fsu
TikTok: https://www.tiktok.com/@masa_fsu

На любой твой вопрос всегда готова ответить координатор русскоязычных программ Алина!
Calendar: https://calendly.com/masainforus
E-Mail: masainforus@masaisrael.org
"""

aboutBlog = \
"""
Хочешь узнать, как пройти консульскую проверку или выбрать подхоядщую программу Маса? А может, получить гайд по русскоязычным кофейнями Тель-Авива или инструкцию по сбору чемодана? Все самые полезные и актуальные статьи читай в нашем <a href='https://www.masaisrael.org/ru/blog/'>блоге!</a>
"""

aboutParents = \
"""
<b>Для родителей несовершеннолетних</b>

СЭЛА — универсальная и самая популярная программа подготовки молодых людей к поступлению в израильские колледжи и университеты. Программа проходит в двух городах — в Ницане и Кармиэле.

Еврейское агентство «Сохнут» и международная компания «Israel Experience» предлагают молодым ребятам от 17 до 21 года уникальную возможность обучения в Израиле.
Если у вас есть аттестат зрелости и вы стремитесь получить престижное международное образование, познакомиться с израильским обществом и культурой, встретить новых друзей, приобрести незабываемый опыт жизни в Израиле — программа «СЭЛА-МИР» созданна именно для вас!
«СЭЛА-МИР» — это дом вдали от дома, это программа, которая предоставляет тебе полный спектр успешной подготовки к поступлению в высшие учебные заведения Израиля.

<b>Что предлагает программа:</b>
 • Интенсивный курс изучения иврита в группах различных уровней — изучение иврита на протяжении 8 месяцев
 • Английский, математика и факультативные занятия — при наличии желающих (выбор факультативны занятий проходит совместно с коллективом программы по приезду на программу)
 • Подготовка к сдаче психометрического экзамена для поступления в вузы Израиля
 • Участники находятся на полном обеспечении и получают ежемесячную стипендию в размере 200 шек на протяжении 7 месяцев
 • Помощь в подготовке домашних заданий
 • Дополнительное образование: лекции и семинары по изучению традиции и истории еврейского народа на русском языке, общественные мероприятия, благотворительные проекты, празднование еврейских и израильских праздники
 • Экскурсии по стране и пешие походы
 • Проживание в Молодежном центре с доступом в компьютерный класс и библиотеку
 
<b>​Продолжительность программы:</b>
8 месяцев (обязательных) — по окончанию 8 месяцев у ребят есть возможность проживания в молодёжном центре от 2 до 4 месяцев (при получении специального разрешения от директора программы)

<b>Требования к участникам программы:</b>
 • Возраст от 17 лет до 21 года на день начала учебы в Израиле
 • Аттестат зрелости (к моменту прибытия в Израиль) со средним балом не менее 4 (по пятибальной системе)
 • Успешное прохождение экзамена и собеседования. Собеседование проходят и кандидат и один из родителей.
 • Право на репатриацию согласно Закону о возвращении
 • При приеме на программу участники подписывают декларацию о состоянии здоровья
 • Получение гранта Масы

<b>Условия проживания:</b>
 • Учащиеся проживают в Молодежном центре Еврейского агентства
 • Участники программы проживают по 3-4 человека в комнате. В каждой комнате, кроме кроватей и письменных столов, есть общий обеденный стол, полки, кухонный уголок
 • К услугам ребят — компьютерный класс, библиотека, прачечная
 • Сотрудники центра — директор, социальный работник, координатор по культурным мероприятиям, завхоз, сестра-хозяйка, а также группа инструкторов (мадрихим), проживающих в самом Центре. К ним можно обратиться в любое время суток с любым вопросом или проблемой
 • Кроме того, персонал Центра поддерживает связь с семьями воспитанников и сообщает им об успехах детей
"""


# --------------------------------------REGISTRATION--------------------------------------
baseRegister = \
"""
<b>Регистрация</b>

Чтобы тебе было удобнее, мы разработали систему, позволяющую автоматически отправлять твои данные для связи с организаторами программ.

Я <i>один раз</i> спрошу у тебя твоё имя, электронную почту и номер телефона, которые мы используем исключительно для того, чтобы передать их выбранному тобой организатору.
<i>Ты сможешь поменять данные в любой момент.</i>

<b>Ответь в сообщении своим именем в формате:</b>
<i>Фамилия Имя</i>
"""

profileMessage = \
"""
<b>Профиль</b>

<b>Твои данные:</b>
 • <b>Имя</b>: <span class="tg-spoiler">{}</span>
 • <b>Телефон</b>: <span class="tg-spoiler">{}</span>
 • <b>Почта</b>: <span class="tg-spoiler">{}</span>
 
<b>Можешь поменять регистрационные данные либо посмотреть историю своих заявок</b>
"""

profileMessageLoggedOut = \
"""
<b>Зарегистрируйтесь, чтобы иметь доступ к истории своих заявок и редактировать свои данные для связи с организаторами программ.</b>
"""

regHistoryNoLogs = \
"""
Похоже, ты ещё не оставлял ни одной заявки!

Посмотри программы, которые мы предлагаем — точно найдёшь себе что-нибудь по душе! :)
"""

regHistory = \
"""
<b>Тут ты найдёшь программы, на которые уже отправлял свою заявку:</b>
"""

regEdit = \
"""
<b>Если ты неправильно ввёл данные при регистрации — поменяй их на актуальные по кнопкам ниже.</b>
"""

regEditName = \
"""
<b>Пожалуйста, введи новое имя:</b>
"""

regEditPhone = \
"""
<b>Пожалуйста, введи новый номер телефона:</b>
"""

regEditEmail = \
"""
<b>Пожалуйста, введи новый адрес электронной почты:</b>
"""


# --------------------------------------MAIN DICTIONARY--------------------------------------
"""
  function that creates a texts dictionary which loads the texts as needed using lambdas
  you need to call() the element later in code in order to get the text itself, else you will just get the lambda function's object returned
"""
def generate_texts_dictionary():
  # get all the variables defined in the module
  variables = {name: (lambda value=value: value) for name, value in globals().items()
               if not name.startswith("__") and not callable(value)}
  return variables

# call the function to generate the texts_dictionary
base_texts = generate_texts_dictionary()
