# --------------------------------------FAQ--------------------------------------
faqMessage = \
"""
<b>Здесь</b> ты найдёшь ответы на самые часто задаваемые вопросы, касающиеся Масы.

<i>Пожалуйста, выбери интересующий тебя вопрос в меню ниже.</i>
"""

faqGrant = \
"""
<b>Кто имеет право на получение гранта Маса?</b>

Ты можешь претендовать на грант Маса, если:

 • Ты соответствуешь Закону о Возвращении в Израиль (для подтверждения необходимо пройти консульскую проверку);
 
 • У тебя есть среднее образование и тебе от 18 до 34 лет (врачи и Masa Tech до 40);
 
 • Ты не имеешь Израильского гражданства ИЛИ, в случае его наличия, прожил за пределами Израиля как минимум 4 года подряд, покинув Израиль в возрасте до 14 лет;
 
 • Ты не участвовал(-а) в долгосрочных программах в Израиле (включая академические программы) длительностью более четырех месяцев с сентября 2004 года;
 
 • В течение двухлетнего периода до начала программы не находился(-ась) в Израиле более четырех месяцев подряд, если тебе уже исполнилось 18 лет.
"""

faqRusForeignResidents = \
"""
<b>Могут ли эмигранты из стран бывшего СССР, проживающие в других странах, принять участие в программах и получить грант Маса?</b>

Да, грант будет рассчитан индивидуально финансовым отделом Маса.
"""

faqProvider = \
"""
<b>Кто такие «провайдеры»?</b>

Программы, поддерживаемые проектом Маса, осуществляются провайдерами, которые фактически реализуют программы. 
Сферы деятельности провайдеров самые разные — университеты, колледжи и институты, туристические компании, молодежные движения и йешивы.

"""

faqWork = \
"""
<b>Могу ли я работать во время программы?</b>

Участники программ не имеют разрешения на работу в Израиле. Если во время работы без разрешения будет получена травма, то оплата лечения и дальнейшего восстановления будет производиться полностью за счет участников. Это правило не распространяется на удаленную работу на другие страны, если это не мешает учебному процессу на программе.

"""

faqCost = \
"""
<b>Как определяется стоимость программы?</b>

Стоимость программы определяется провайдерами. В большинстве случаев грант Маса не покрывает полную стоимость программы, и поэтому каждая программа предусматривает определенную долю личного участия.

"""

faqVacation = \
"""
<b>Могу ли я взять отпуск во время программы?</b>

Ты можешь взять отпуск, но сроки и даты необходимо заранее согласовать с организатором. Есть даты в которые нельзя уезжать с программы, так как пропустишь занятия и экзамены на программе.

"""

faqContact = \
"""
<b>К кому я могу обратиться за дополнительной информацией?</b>

Для получения информации о программах, регистрации и процедуре прохождения консульской проверки следует <a href='https://calendly.com/masainforus'>обратиться</a> к координатору программ Маса — Алине.

"""

faqParticipantSafety = \
"""
<b>Безопасность и защита</b>

Безопасность и защита участников, сотрудников и партнеров программ Маса — наш главный приоритет. 
Маса поддерживает строгие стандарты безопасности во всех мероприятиях, спонсируемых программой.
Как совместный проект правительства Израиля и Еврейского агентства, программы Маса регулярно получают обновленную информацию о безопасности и защите. Наши сотрудники находятся в контакте с каждой программой, чтобы обеспечить эффективный обмен информацией и оказать необходимую помощь.
Если у тебя есть вопросы, касающиеся безопасности, пожалуйста, свяжись с нами.
"""

faqSafety = \
"""
<b>Каковы действующие правила безопасности при поездках в Израиль и где я могу найти самую актуальную информацию?</b>

На <b><a href='https://www.gov.il/ru/departments/ministry_of_health'>сайте Министерства здравоохранения</a></b> Израиля 
регулярно обновляется актуальная информация о безопасности поездок в Израиль и из Израиля.

"""

faqGrantHandout = \
"""
<b>Получаю ли я грант «на руки»?</b>

Нет. Несмотря на то, что грант является личным, выделяется определенному лицу, и ты получаешь уведомление о размере гранта, фактическая сумма передается провайдеру выбранной тобой программы.

"""

faqLostGrant = \
"""
<b>Потеряю ли я грант, отказавшись от участия и сменив организатора?</b>

Это зависит от того, на каком этапе ты отказываешься. 
В случае, если отказ от программы до ее начала или в течение первых 2 месяцев — грант сохраняется полностью. Если после — сумма будет уменьшаться пропорционально сроку.

"""

faqApply = \
"""
<b>Где и когда нужно подавать заявку на грант?</b>

После регистрации на программу организатор отправит тебе ссылку-заявку на грант.
"""

faqMasa = \
"""
<b>Что такое Маса?</b>

Это совместный образовательный проект правительства Израиля и Еврейского агентства, задача которого поддержать долгосрочные программы в Израиле. 
Цель проекта — способствовать ежегодному пребыванию в Израиле тысяч молодых людей в возрасте от 18 до 34 (врачи и Masa Tech до 40) лет из стран диаспоры в рамках различных долгосрочных программ продолжительностью от 4 до 12 месяцев.
Мы даём возможность еврейской молодёжи со всего мира принять участие в долгосрочных программах в Израиле, учиться, путешествовать и заводить новых друзей.

"""

faqProgram = \
"""
<b>Какие есть программы Маса?</b>

Сегодня существует более 300 программ Маса. Помимо русскоязычных программ, на выбор участникам предоставляются программы на английском, испанском, французском языках и на иврите. Они затрагивают самые различные области и включают академические (университетские) программы, профессиональные курсы, стажировки, волонтерские программы, изучение иудаизма в религиозных учебных заведениях и программы молодежного движения.

"""

faqGrantEnglish = \
"""
<b>Могу ли я поехать на англоязычную программу?</b>

Да, если знаешь английский. Сумма гранта в этом случае не меняется, но стоимость личного участия выше.
"""

faqGrantHebrew = \
"""
<b>Должен ли я знать иврит для участия в программах Маса?</b>

Нет, но если ты уже немного знаешь язык, то сможешь пройти в продвинутую группу изучения в ульпане.
"""


"""
  function that creates a texts dictionary which loads the texts as needed using lambdas
  you need to call() the element later in code in order to get the text itself, else you will just get the lambda function's object returned
"""
def generate_texts_dictionary():
  # Get all the variables defined in the module
  variables = {name: (lambda value=value: value) for name, value in globals().items()
               if not name.startswith("__") and not callable(value)}
  return variables

# Call the function to generate the texts_dictionary
faq_texts = generate_texts_dictionary()
