# --------------------------------------GRANTS--------------------------------------
grantsVisasMessage = \
"""
Узнай больше про финансовую и визовую помощь, оказываемую нашей организацией.

Пожалуйста, выбери интересующий тебя вопрос в меню ниже.
"""

grantsMessage = \
"""
<b>Гранты Маса</b>

Маса работает над тем, чтобы еврейской молодежи со всего мира было проще приехать в Израиль.
Мы предлагаем гранты на обучение, чтобы поездка в Израиль была еще более доступной.
"""

grantRequirements = \
"""
<b>Гранты Маса</b>

<b><u>Ты имеешь право на получение гранта Маса, если:</u></b>

 • Соответствуешь Закону о Возвращении в Израиль (для подтверждения необходимо пройти консульскую проверку*);
 
 • У тебя есть среднее образование и тебе от 18 до 34 лет (врачи и Masa Tech до 40);
 
 • Ты не имеешь Израильского гражданства ИЛИ, в случае его наличия, прожил за пределами Израиля как минимум 4 года подряд, покинув Израиль в возрасте до 14 лет;
 
 • Ты не участвовал(-а) в долгосрочных программах в Израиле (включая академические программы) длительностью более четырех месяцев с сентября 2004 года;
 
 • В течение двухлетнего периода до начала программы не находился(-ась) в Израиле более четырех месяцев подряд, если тебе уже исполнилось 18 лет.
 

<i>Если ты участвовал в 6-8-недельной программе (например, Onward) с 2016 года и хочешь принять участие в долгосрочной программе Maсa, это может повлиять на твой грант. Для уточнения деталей, пожалуйста, свяжись с masainforus@masaisrael.org</i>


<u>*Участие в программах Маса предполагает ускоренный процесс прохождения консульской проверки. С нашей помощью ты можешь быстрее оказаться в Израиле!</u>

<b>Обрати внимание: для того, чтобы иметь право на финансовую помощь от Маса, тебе необходимо подать заявку на грант до даты начала твоей программы</b>
"""

grantAbout = \
"""
<b>Что такое «грант»?</b>

Маса создавалась правительством Израиля и Еврейским агентством для того, чтобы ты мог познакомиться с Израилем и приобрести опыт самостоятельной жизни в новой стране.
А чтобы это было доступно, Маса выделяет гранты на участие от <i>4200$</i> до <i>8400$</i>!

<b>Грант</b> — это сумма, которая выплачивается организатору программы и покрывает б<b>о</b>льшую часть стоимости участия. Его размер зависит от длительности программы.

<b>Что ты оплачиваешь самостоятельно?</b>
 • Перелёт;
 • Сумму личного участия (стоимость программы минус грант).

<i>Сумма личного участия зависит от конкретной программы — от 100$ до 3000$ (при выборе программы от русскоязычного организатора)</i>
"""


# --------------------------------------VISAS--------------------------------------

visasMessage = \
"""
<b>Узнай больше о твои визовых возможностях при участии в программе Маса.</b>

Пожалуйста, выбери интересующий тебя вопрос в меню ниже.
"""

visasA2 = \
"""
<b><u>Виза Маса А2</u></b>


<b>Упрощенная система подачи на визу A-2 после въезда в страну.</b>

По следующей ссылке ты можешь подать заявку на визу — https://govforms.gov.il/mw/forms/APP4A2VISA@piba.gov.il

Заполни все личные данные и отсканируй следующие документы в онлайн-форму:

 1. Форма אש-3 заполняется на каждого участника Masa (находится по ссылке на странице заявки).
 2. Ксерокопия загран. паспорта.
 3. Ксерокопия свидетельства о рождении участника.
 4. Подписанное письмо-приглашение от организатора Masa, подтверждающее участие в программе.

<b>Особенности:</b>
 1. Виза будет отправлена в виде PDF-файла на адрес электронной почты, указанный в онлайн-форме (визу не нужно вклеивать в паспорт).
 2. Запрос визы A-2 может быть сделан только после въезда в страну.
 3. У участника не должно быть любой другой визы в Израиль.
"""

visasB1 = \
"""
<u><b>Рабочая Виза B1 для программы Masa Tech</b></u>


Участники Маса, которые регистрируются на программы, требующие выдачи рабочей визы, должны предоставить те же документы, которые указаны для заявлений на получение визы A2.

Кроме того, рабочая виза выдается нашим участникам имеющим право на возвращение в соответствии с Законом о возвращении, и, следовательно, независимо от того, из какой страны они прибыли, процесс получения права участия в соответствии с Законом о возвращении должен быть завершен с Нативом в странах бывшего Советского Союза или представителями Еврейского агентства в мире. Информацию о процессе можно получить у представителей Еврейского агентства: https://www.jewishagency.org/aliyah/

Внизу страницы сайта ты увидишь ссылку на Глобальный центр обслуживания клиентов с бесплатными звонками из списка стран

Во время проверки соответствия требованиям сообщи либо представителю Натива, либо представителю Еврейского агентства, что ты участник Маса, подающий заявку на визу B1.
"""

visasEnd = \
"""
<u><b>Ближе к концу программы</b></u>

Участники, имеющие визу Masa A2 и приближающиеся к концу своей программы, имеют право на получение рабочей визы B1 на срок до шести месяцев (или один год для участников Masa Tech).

Для выдачи визы участник/организатор должен назначить встречу в одном из бюро регистрации населения за две недели до окончания программы.

<u>В бюро необходимо представить:</u>

 • Паспорт, действительный не менее двух лет.
 • Недавно сделанная фотография на паспорт (на белом фоне, 70% лица, 5 см в длину и 5 см в ширину).
 • Подтверждение завершения участия в программе Маса – форму можно скачать с портала.
 
Если запись назначена заранее, и вышеуказанные документы были представлены, а запрос все еще не одобрен, организатор должен связаться со мной в режиме реального времени, пока стипендиат все еще находится в бюро Управления народонаселения.

* Процесс выдачи визы B1 в Израиле может быть осуществлен только в бюро, а не в штаб-квартире Управления иммиграции и народонаселения.
"""

visasUnderage = \
"""
<u><b>Дети родителей с израильским гражданством</b></u>


Несовершеннолетний участник, у которого хотя бы у одного из родителей есть израильское удостоверение личности, не имеет права на получение визы любого рода.

В таком случае участник должен оформить свой статус до прибытия в Израиль и оформить израильское удостоверение личности/загран. паспорт в местном консульстве. Важно, что он также должен урегулировать вопрос об освобождении от воинской повинности, чтобы не допустить неприятностей по прибытии/отъезде из страны.

Этот процесс можно осуществить с представителем в консульстве или связавшись со следующими лицами для получения более подробной информации:
 • Отдел планирования и исполнения «Мейтав», IDF
 • Голосовая почта за рубежом: 03-738-7010, 03-738-7011
 • Сотрудник штаб-квартиры за границей: 03-7387012
 • Электронная почта: infohul@mail.idf.il
"""


# --------------------------------------MAIN DICTIONARY--------------------------------------
"""
  function that creates a texts dictionary which loads the texts as needed using lambdas
  you need to call() the element later in code in order to get the text itself, else you will just get the lambda function's object returned
"""
def generate_texts_dictionary():
  variables = {name: (lambda value=value: value) for name, value in globals().items()
               if not name.startswith("__") and not callable(value)}
  return variables

# Call the function to generate the texts_dictionary
grants_texts = generate_texts_dictionary()
