# TODO: add sachlav ofek ulpan https://www.masaisrael.org/ru/program/sachlav-ulpan/
# --------------------------------------PROGRAMMES--------------------------------------
# ------------------------------------CATEGORY------------------------------------- 
programmeMessage = \
"""
<b>Программы Маса</b>

<u>Маса — это более <i>300</i> международных программ по всему Израилю.</u>
Из них более <i>60</i> программ на русском языке длительностью от <i>4</i> до <i>8</i> месяцев!

<b>На этих программах ты получишь:</b>
 • Опыт жизни в новой стране
 • Нетворкинг
 • Обучение и/или стажировку в израильской компании
 • Курс иврита и/или английского
 • Экскурсии и семинары
 • Медстраховку
 • Стипендию или питание
 • Проживание в квартире или общежитии

<i>Ты можешь ознакомиться со списком ближайших русскоязычных программ по кнопкам ниже</i>

<b><i><u># ANY CONTACT INFORMATION ON PROGRAMMES' PAGES WILL NOT BE PRESENT IN THE BOT</u></i></b>
"""
# TODO: REMOVE THE COMMENT

progAcademicAll = \
"""
<b>Академические программы</b>

Обучение за границей в израильском университете поможет вам развить навыки и приобрести реальный опыт, повысить свою степень и продвинуть карьеру на новый уровень.
"""

progInternshipAll = \
"""
<b>Стажировки</b>

Если ты хочешь продвинуться в своей нынешней области или исследовать что-то новое, наши консультанты по вопросам карьеры помогут тебе найти идеальную возможность стажировки в Израиле.
"""

progProfAll = \
"""
<b>Профессиональные курсы</b>

Выбери для себя одну из многих возможностей для приобретения знаний, навыков и опыта, необходимых для профессионального развития в современном мире. 
"""

progTechAll = \
"""
<b>MasaTech</b>

MasaTech набирает лучших кандидатов на вакансии во всемирно известной хай-тек сфере Израиля. MasaTech — это самая элитная израильская программа по рекрутингу лучших кандидатов со всего мира для работы в ведущих хай-тек компаниях.
"""

progRemoteAll = \
"""
<b>Удалённая работа</b>

Программа «Masa Remote» предлагает вам невероятный шанс присоединиться к участникам проекта Маса в Израиле, не отказываясь от своей работы!
В рамках «Masa Remote» мы предлагаем уникальную возможность совместить дистанционную работу и опыт жизни в новой стране.
"""

progMedicineAll = \
"""
<b>Врачи и стоматологи</b>

Маса предоставляет возможность для студентов и выпускников медицинских вузов СНГ и Балтии получить врачебную лицензию в Израиле. Наши программы включают в себя документальное сопровождение, полный курс иврита, условия проживания для участников и их супругов.
"""

progLanguageAll = \
"""
<b>Языковые курсы</b>

Языковые программы предлагают участникам углубленное изучение английского языка и иврита для немедленного внедрения полученных знаний прямо в языковой среде - для работы и жизни в Израиле. Наша цель — предложить участникам по-настоящему аутентичный и индивидуальный опыт знакомства со страной. Мы представляем доступ к лучшим ресурсам и практическим знаниям, для того чтобы сделать вашу поездку актуальной и помочь почувствовать себя в Израиле как дома.
"""

#--------------------------------------PROGRAMMES--------------------------------------
progOranimATI = \
"""
<b>ORANIM A.T.I. INTENSIVE</b>

Программа обеспечивает комплексную экзаменационную практику (полные навыки и пробные экзамены) с индивидуальной обратной связью и стратегиями обучения для достижения максимальных результатов на экзаменах.

На программе гарантировано 100% погружение в языковую среду, так как основным языком является английский. (В программе принимают участие студенты со всего мира, включая Латинскую Америку, страны бывшего Советского Союза, Европу…) Все экскурсии, занятия, поездки и мероприятия проводятся на английском языке.

Программа также предоставляет возможность улучшить английский на один уровень по всем четырем языковым навыкам (аудирование, чтение, письмо, разговорная речь) в соответствии с системой CERF. <b>Кандидаты должны владеть английским языком на уровне Upper Intermediate / B2.</b>

1. Даты программы: с конца июня по конец октября;
2. Цена после получения гранта от Masa: страны Бывшего Советского Союза — 600 долларов, для первой программы Masa — Латинская Америка и Восточная Европа — 550 долларов или меньше, другие страны — уточните у нас точную стоимость. Все студенты, которые хотят продолжить вторую программу Masa — также за точностью обращайтесь к нам;
3. Расположение: Колледж Ораним, в 15 минутах езды от Хайфы и в полутора часах езды от Тель-Авива;
4. В стоимость программы входит:
   • проживание в студенческом общежитии (2-3 студента в комнате);
   • стипендия в размере 100 долларов в месяц;
   • медицинская страховка;
   • проездной для ⅕ Израиля (Хайфа, Акко, Тивон, Северный Израиль) + скидка 33% на транспорт по всей стране;
   • академические курсы;
   • поездки по Израилю.

<b>Дополнительная информация:</b>
 • <i>WhatsApp</i> +972 58-699-6811
 • <i>Электронная почта</i> masaoranim@oranim.ac.il
 • <i>Instagram</i> https://www.instagram.com/masa_oranim/
"""

progOranimPreMA = \
"""
<b>ORANIM PRE MA</b>

<u>Pre M.A.</u> — единственная программа МАСА, предоставляющая участникам сильнейший интенсивный курс иврита (порядка 700 академических часов). 80% выпускников программы достигают уровня “далет”, который дает возможность поступать в ВУЗы Израиля или трудоустраиваться в ивритоязычные компании.
Программа также предлагает академические курсы английского по уровням и курсы факультета английского языка (при уровне Upper Intermediate (B2 – C1).
Во втором семестре можно принять участие в курсах с разных факультетов Ораним на иврите с израильскими студентами (<i>физика, искусство, биология, социология, английский, математика, история и т.д</i>).
На программе Pre M.A. мы всегда обеспечиваем индивидуальный подход к каждому. Участники программы получают консультации по выбору ВУЗа, участвуют в днях открытых дверей, академических ярмарках и т.д.

 • даты программы: 31.10.2023 — 02.03.2024
 • проживание в общежитии (2-3 студента в комнате с отдельной кухней и душевой);
 • стипендия 180$ в месяц;
 • мед. страхование;
 • студенческий билет, дающий скидку 33% на транспорт по всей стране;
 • академические курсы;
 • поездки и путешествия по Израилю.

<b>Дополнительная информация:</b>
 • <i>WhatsApp</i>: +972 58-699-6811
 • <i>E-mail</i>: masaoranim@oranim.ac.il

"""

progArielBA = \
"""
<b>ARIEL BA</b>

Академическая программа Ariel B.A. представлена следующими направлениями:
 • International Pre-Med Academic (B.Sc.) Program (IPAP)
 • BSc in Physics (первая степень в области Физики)
 • Economics and Business Administration (первая степень в области Экономики)

<u>International Pre-Medical (B.Sc.) Academic Program (IPAP)</u>
Международная программа, основанная на <b>англоязычном</b> бакалавриате в университете, которое дает студентам основательную научную базу для будущего изучения клинической медицины.

<u>Обучение степени бакалавра в области Физики (BSc)</u>
Обучение проводится на русском языке. 
Академические дисциплины в рамках программы: 
 • физика (механика);
 • линейная алгебра; 
 • математическая физика; 
 • лаборатория по физике.

<u>Обучение степени бакалавра в области Экономики (BA)</u>
Обучение проводится на русском языке. 
Академические дисциплины в рамках программы: 
 • математика для экономистов;
 • введение в микроэкономику; 
 • статистика для экономистов; 
 • межличностные процессы в управлении.

Помимо академических дисциплин, в программы по Физике и Экономике также включено:
 • Интенсивный курс иврита (500 часов)
 • Лекции и семинары в области истории и культуры Израиля
 • Экскурсии по Израилю и студенческие мероприятия
 
По окончанию каждой из программ, у участников есть возможность поступления в университет для продолжения учебы, с учетом уже пройденных академических дисциплин. 

<b>Дополнительная информация:</b>
 • <i>WhatsApp</i>: +972534962541
 • <i>Webpage</i>: https://www.ariel.ac.il/wp/masa/
"""

progArielMA = \
"""
<b>ARIEL MA</b>

<u>MBA — Master of business administration (Management)</u>
Программа позволяет погрузиться в образовательную систему Израиля, познакомиться культурой, историей и особенностями жизни в Израиле, изучать иврит, а также получить новый опыт и приобрести новые знакомства.
Предназначена для участников с академическим образованием (на базе степени бакалавр/специалист), желающих улучшить свои знания в сфере Менеджмента и получить полезные навыки под руководством ведущих в своих областях специалистов. Обучение проводится на русском или английском языках.
В программу входит:
 • Академические дисциплины: управление и организационное поведение; финансирование фирмы; экономика управления бизнесом; TQM – Стратегии Управления Качеством
 • Интенсивный курс иврита (500 часов)
 • Лекции и семинары в области истории и культуры Израиля
 • Экскурсии по Израилю и студенческие мероприятия
 • Курс английского языка

<u>Strategic & Digital Advertising</u>
Магистерская программа по стратегической и цифровой рекламе на английском языке включает теории коммуникации, маркетинговых коммуникаций и рекламы в стратегические и цифровые коммуникационные кампании, а также методы брендинга на индивидуальном и организационном уровнях.

По окончанию программы Маса, у участников есть возможность поступления в университет для продолжения учебы, с учетом уже пройденных академических дисциплин. 

<b>Дополнительная информация:</b>
 • <i>WhatsApp</i>: +972534962541
 • <i>Webpage</i>: https://www.ariel.ac.il/wp/masa/
 • <i>E-Mail</i>: masa@ariel.ac.il

"""

progArielResearch = \
"""
<b>ARIEL RESEARCH</b>

Ариэльский университет предлагает кандидатам, которые интересуются наукой, в возрасте от 21 до 34 лет, пройти уникальную академическую программу – индивидуальная научно-исследовательская работа под руководством ведущих специалистов соответствующей кафедры.

Цель программы – дать возможность молодым учёным развивать свои научные исследования. Главной особенностью проекта является индивидуальный подход к построению исследования: подбор научного руководителя до начала программы; формирование индивидуального научного плана работы; при необходимости доступ к лабораториям и т. д. В процессе обучения участники:
 • получат доступ к мировой базе данных в области своего исследования, а также к научно-исследовательским центрам/лабораториям; 
 • познакомятся с культурой, историей и особенностями жизни в Израиле;
 • изучат иврит (500 часов – сертификат от Министерства образования); 
 • приобретут новый опыт и новые знакомства.

<b>Дополнительная информация:</b>
 • <i>WhatsApp</i>: +972534962541 
 • <i>Webpage</i>: https://www.ariel.ac.il/wp/masa/
 • <i>E-Mail</i>: masa@ariel.ac.il
"""

progOranimEnglish = \
"""
<b>MASA ORANIM WORKSPACE</b>

Международная программа <u>"English for the Workplace"</u> предлагает участникам изучение английского языка и приобретение навыков, необходимых для поиска работы в международной среде. В программе принимают участие студенты со всего мира, включая Латинскую Америку, страны бывшего Советского Союза, Европу и т.д. Все экскурсии, занятия, поездки и мероприятия проводятся на английском языке. Программа также предоставляет возможность улучшить английский на один уровень по всем четырем языковым навыкам (аудирование, чтение, письмо, разговорная речь) в соответствии с системой CERF.

Программа <u>"English for the Workplace"</u> предоставляет сильнейший курс делового английского языка (250 академических часов) с развитием ключевых навыков делового общения (составление резюме, деловая переписка, презентации, подготовка к экзамену BEC Vantage). <b>Кандидаты должны обладать уровнем английского языка Intermediate / B1.</b>

1. Даты программы: два раза в год — в конце февраля и в конце августа.
2. Цена после получения гранта от Masa: страны Бывшего Советского Союза — 600 долларов, для первой программы Masa — Латинская Америка и Восточная Европа — 550 долларов или меньше, другие страны — уточните у нас точную стоимость. Все студенты, которые хотят продолжить вторую программу Masa — уточните у нас точную стоимость.
3. Расположение: Колледж Ораним, в 15 минутах езды от Хайфы и в полутора часах езды от Тель-Авива.
4. В стоимость программы входит:
   • проживание в студенческом общежитии (2-3 студента в комнате)
   • стипендия в размере 100 долларов в месяц
   • медицинская страховка
   • проездной для ⅕ Израиля (Хайфа, Акко, Тивон, Северный Израиль) + скидка 33% на транспорт по всей стране
   • академические курсы
   • поездки по Израилю

<b>Дополнительная информация:</b>
 • <i>WhatsApp</i> +972 58-699-6811
 • <i>Электронная почта</i> masaoranim@oranim.ac.il
 • <i>Instagram</i> https://www.instagram.com/masa_oranim/
"""

progShiltonMedia = \
"""
<b>SHILTON BETAR</b>

<u>Маса Бейтар МЕДИА-программа</u> учебы и стажировки в медиа-сфере в израильских PR-компаниях, рекламных агентствах, а также в правительственных офисах страны и центральных СМИ.
Программа предназначена для: 
 • медиа-специалистов;
 • SMМ- специалистов;
 • журналистов;
 • digital-маркетологов и PR-щиков; 
 • тех, кто хочет научиться новой профессии и пройти стажировку в израильском правительстве.

<i>Первая часть программы</i> будет включать в себя:
 • Интенсивный иврит
 • Экскурсии и поездки
 • PR, взаимодействие со СМИ; SMO, SMM, реклама и продвижение
 • графические и видео-редакторы.

<i>Вторая часть</i> рассчитана на:
 • Стажировки
 • Встречи с политическими и общественными деятелями.

Программа оплачивает:
 • Проживание в Иерусалиме в квартирах;
 • Медицинская страховка;
 • Ежемесячный проездной;
 • Стипендия 1800$ (1000 шек/мес).
"""

progWayCareer = \
"""
<b>ISRAEL WAY - CAREER GROWTH</b>

<u>Программа "Карьерный рост"</u> — это 4-6 месяцев профессиональной стажировки, которые обеспечат молодым людям в возрасте 21-34 лет незабываемое время в Израиле. Программа предлагает людям с высшим/профессиональным образованием и/или опытом работы по специальности, пройти стажировку в одной из ведущих израильских компаний, соответствующую профессиональному профилю. 
Долговременная, серьезная стажировка в Израиле поможет участникам открыть новые карьерные горизонты, установить профессиональные и личные контакты, углубить свои знания и приобрести передовые навыки в своей профессии.

В дополнение к стажировке, программа предлагает:
 • учебные курсы по изучению иврита, 
 • различные мастер-классы и семинары по интересным темам: истории, бизнесе и экономике Израиля, культурные мероприятия, экскурсии и поездки по стране.

<u>Программа "Карьерный Рост"</u> максимально приближена к повседневной жизни Израиля, и дает возможность изнутри прочувствовать страну.
"""

progTlalimStart = \
"""
<b>TLALIM - START</b>

<u>Программа «Старт»</u> помогает участникам получить международный опыт, строчку в резюме, рекомендации на английском и иврите по окончанию практики, а также впервые открыть двери в профессиональное сообщество и завязать социальные контакты в Израиле. Компания «Тлалим» с радостью станет партнёром в этом приключении!

Программа зародилась в 2014 году в городе Иерусалим и создана помочь молодым специалистам достигнуть главной цели: «стартануть». Наши сотрудники отдела стажировок ежегодно работают с 500–600 студентами из стран СНГ, США, Южной Америки, Европы.

<u>Программа «Старт»</u> – это перспективы получения профессионального опыта и личностного роста, а также жизнь и путешествия по Израилю на протяжении шести месяцев, участие в семинарах и мероприятиях, знакомство с ивритом и нетворкинг. Продолжительность программы зависит от выбора города.

Концепция программы <u>«Старт»</u>:
 • продолжительность программы 6–7 месяцев – это время заложено для «погрузиться и оглядеться»;
 • знакомство с языком: решение бытовых вопросов на иврите и стремление к small talks в период профессиональной стажировки;
 • цикл встреч с израильскими HR-ами: подготовка к встрече с профессиональным сообществом, знакомство с культурой и менталитетом;
 • индивидуальный поиск стажировки для каждого участника.

Программа <u>«Старт»</u> включает:
 • Изучение иврита
 • Знакомство и погружение в мир трудоустройства в Израиле.
 • Прохождение стажировки по специальности или опыту работы.

В рамках программы <u>«Старт»</u> участники проживают в городах:
 • столица Израиля – Иерусалим (6 месяцев),
 • центр страны – Тель-Авив (6 месяцев),
 • северная столица – Хайфа (6 месяцев),
 • крупнейший город Юга – Беер-Шева (6 месяцев),
 • сердце туризма страны – Эйлат (6 месяцев).

Подробнее о программе: https://ru.tlalimgroup.com/start-masa/

Дополнительная информация:
 • Координатор программ: Тали Балан
 • Tel.: +972-54-974-1234
 • Telegram: @Tali_Balan
 • talib@authenticisrael.com
"""

progXPMaster = \
"""
<b>MASA ISRAEL EXPERIENCE - MASTER PLUS STATUS</b>

На выбор <u>2 варианта</u>:

 • Базовый курс иврита + Профессиональная стажировка
 • Полный курс иврита со сдачей государственного экзамена + Курс «Начало профессионального пути в Израиле».

Программа также включает экскурсии и поездки по Израилю, волонтерство, семинары, лекции и неформальные встречи в рамках знакомства с историей, политикой, социальной жизнью Израиля, посещение культурных событий и участие в развлекательных мероприятиях.

<b>Первая программа</b>:

<i>Базовый курс иврита</i>
Месяц изучения языка по уникальной методике «иврит на иврите» с акцентом на разговорную речь.

<i>Профессиональная стажировка</i>
Стажировка подбирается индивидуально нашими HR-специалистами.
Работа по подбору стажировки начинается за 2 месяца до приезда на программу.

Процесс подбора:
 • проверка вашего резюме HR-специалистом;
 • индивидуальная консультация с рекомендациями по резюме и согласованием ожиданий;
 • подбор компании;
 • собеседование.

<b>Вторая программа</b>:

<i>Полный курс иврита</i>
Обучение на базе ульпана «Эцион» по системе «иврит на иврите» — наиболее успешная система обучения в Израиле.
Участники проходят тестирование и распределение по группам в зависимости от уровня знания языка.
График учебы: 5 дней в неделю в первой половине дня (25 учебных часов в неделю).
Занятия ведут профессиональные преподаватели Министерства просвещения Израиля.

<i>Курс «Начало профессионального пути в Израиле»</i>
Курс включает набор инструментов для знакомства с рынком труда в Израиле и адаптации в нем наших участников. Это серия воркшопов и интерактивов, которые помогут молодым специалистам после программы «Маса» начать карьерный путь в новой стране. Курс проводят наши координаторы по стажировкам – специалисты в сфере HR.

Программы проходят несколько раз в год в городах: Раанана, Хайфа, Тель-Авив.

Подробнее о программах: http://israelxp.tilda.ws/masterstatus
"""

progSachlavTop = \
"""
<b>SACHLAV — TOP ISRAEL INTERNS</b>

<u>Top Israel Interns</u> предлагает участникам проекта Маса 5-месячную стажировку для выпускников средних школ и колледжей от 18 до 30 лет, которые хотят начать свою карьеру, выйти на рынок труда и прочувствовать жизнь в Израиле как его местный житель. Наши участники получают ценный практический опыт в своей области и выходят на работу с навыками, необходимыми им для достижения успеха.

<u>Sachlav FastTrack Jobs</u> — это эксклюзивная возможность трудоустройства для высококвалифицированных специалистов, которые хотят пробиться в своей области и получить качественный международный опыт. Участники программы FastTrack живут в Израиле 5, 7 или 9 месяцев и работают в ведущих израильских компаниях. Всего за несколько месяцев они приобретают навыки, определяющие карьеру, и покидают Израиль с инструментами, мышлением и знаниями, которые им необходимы, чтобы стать лидерами завтрашнего дня.

Программа включает в себя:
 • Проживание во время обучения; 
 • Изучение языка и занятия на иврите;
 • Стажировки;
 • Помощь в социализации, поддержка программы, профориентация;
 • Поездки и мероприятия;
 • Программа карьерного роста.

Подробнее о программе: https://sachlav.com/portfolio-item/masa-5-month-program/
"""

progWayMelamedia = \
"""
<b>ISRAEL WAY — MELAMEDIA</b>

Профессиональные тренинги в различных областях (психология, коучинг, театр, фотография, философия, музыка и др.), социальные, культурные и человеческие впечатления, которые помогут осознать и понять свою индивидуальность. Глубокое и аутентичное знакомство с историей и актуалией еврейского народа и государства Израиль.Тренинги личностного роста, мастер-классы и воркшопы с лучшими преподавателями страны. Участники программы имеют возможность посещать лекции и занятия «Университета IsraelWay», набирать за это баллы и получать повышенную стипендию. 

<i>В программу также входят</i>:
 • Проживание; 
 • Экскурсии, поездки по стране, волонтерство;
 • Курс изучения иврита;
 • Медицинская страховка; 
 • Занятия в университете;
 • Стипендия 220$ в месяц.

Дополнительная информация:
 • Координатор программы: Ирина Воробейчик
 • +972732313981
 • team@israelway.ru
"""

progWayWeb = \
"""
<b>ISRAEL WAY — WEB OR GRAPHIC DESIGN</b>

Ни для кого из нас не будет секретом то, что большую часть окружающего нас мира мы познаем визуально. Говорят о 80%. Но вы когда-нибудь задумывались о том, как это происходит? Почему наш взгляд останавливается на определенных предметах, образах, символах? Как нас околдовывает волшебство графического дизайна?Задумываясь о создании такой программы, мы просто ее увидели. Увидели в том городе, в котором она проходит – в Тель-Авиве. Город-палитра, город-фактура, город-вдохновение, город-дизайн. 

Два параллельных курса программы: <b>Graphic design</b> или <b>Web design</b> — сочетают в себе учёбу в частном колледже по программе, утвержденной Министерством труда, и практику в компаниях большого Тель-Авива.После сдачи государственных экзаменов участники будут обладать дипломом об окончании курса, который, в сочетании со стажем, поможет открыть двери в мир трудоустройства. Кроме того, колледж предоставляет выпускникам возможность продолжить финансируемое обучение на параллельных курсах, а также курсах Search.
"""

progSachlavOfek = \
"""
<b>SACHLAV — OFEK</b>

<u>Сахлав</u> — организатор программы МАСА более чем с 30-ти летним опытом в сфере образовательного туризма в Израиле.
Особенность наших программ МАСА — профессиональное и карьерное развитие участников, а также упор на изучение иврита с носителями языка.

Мы являемся лидером в индивидуальном подборе стажировок в израильских компаниях по абсолютно разным профессиям — от музыкантов, режиссеров до инженеров, IT-специалистов, архитекторов (смотри программу Ofek TII)
С нами ты сможешь реализовать себя в Израиле!

<b>Наши программы</b>:

<b>OFEK TII</b>
Это комбинированная программа, позволяющая начать изучение иврита
и пройти профессиональную стажировку в израильской компании.

<u>Структура программы:</u>
 • эффективное изучение иврита на протяжении первых 3-х месяцев (4 дней в неделю в первой половине дня);
 • профессиональная стажировка на протяжении следующих 3-х месяцев программы;
 • встречи с профессионалами и экспертами из различных сфер деятельности.

<i>Длительность: 6 месяцев</i>
<i>Город проведения: Бат Ям</i>
<i>Сумма личного участия: $1000</i>


<b>OFEK LAWYERS</b>
Это курс профессиональной адаптации участников с высшим юридическим образованием.
Наша команда — это высококлассные юристы, которые сами успешно прошли этот путь, а сейчас являются практикующими юристами . Специально для вас мы собрали бесценный опыт и знания, которые помогут максимально облегчить ваш путь вхождения в правовой мир Израиля.

<u>Структура программы: </u>
 • Курс лекций по правовой системе Израиля и ее конкретным отраслям;
 • Стажировка в одном из израильских адвокатских офисов;
 • Ульпан по изучению иврита – 5 месяцев интенсивный курс (*в случае прохождения стажировки ульпан длится 3 месяца).

<i>Длительность: 6 месяцев</i>
<i>Город проведения: Бат Ям </i>
<i>Сумма личного участия: $1100</i>


<b>OFEK QA</b>
Это программа профессионального курса с нуля по специальности QA инженер (тестировщик).
QA инженер (от англ. Quality Assurance) — значит «обеспечение качества». Задача QA инженера обеспечить качество разработки ПО, его функционального тестирования — простыми словами, QA инженеры тестируют приложения и программы, защищают от хакеров, передают описанные проблемы разработчикам для исправления.

<u>Структура программы: </u>
 • Шестимесячный курс обучения по специальности QA инженер (обучение с нуля, не требует предыдущих навыков в программировании);
 • Пятимесячный курс изучения иврита — 3 дня в неделю, 3-4 часа в день.

<i>Длительность: 6 месяцев</i>
<i>Город проведения: Бат Ям </i>
<i>Сумма личного участия: $1300</i>


<b>OFEK UX UI</b>
Это программа профессиональной переподготовки (обучение с нуля) по специальности UX UI дизайнер.
На фоне роста и развития информационных технологий профессия UX/UI дизайнера становится не только востребованной, но и необходимой
для большинства современных IT компаний. Специальность опирается
на принципы взаимодействия человека с компьютером, психологические принципы обработки и восприятия информации, а также принципы принятия решений.

<u>Структура программы: </u>
 • Шестимесячный курс по UX UI дизайну (обучение с нуля, не требует предыдущих навыков в дизайне);
 • Пятимесячный курс изучения иврита — 3 дня в неделю, 3-4 часа в день;
 • Разработка проектов в течение обучающего курса, которые в последствии пойдут к вам в портфолио.

<i>Длительность: 6 месяцев</i>
<i>Город проведения: Бат Ям </i>
<i>Сумма личного участия: $1300</i>


<b>OFEK FAMILY</b>
Это комплексная программа для семей и матерей-одиночек с детьми всех возрастов, включающая в себя изучение иврита и стажировку. 
Программа <u>Ofek Family</u> — одна из старейших программ в проекте МАСА, существует с 2004 года.

<u>Структура программы: </u>
 • Интенсивный курс по изучению иврита: 500 часов, 5 месяцев, 5 дней в неделю Преподавание иврита на иврите носителями языка;
 • Экзамен от министерства образования;
 • Прохождение профессиональной стажировки по специальности в израильских компаниях;
 • Личный подход и семейная атмосфера.

<i>Длительность: 6 месяцев</i>
<i>Город проведения: Ашдод</i>
<i>Сумма личного участия: $1050</i>
"""

progXPDoctors = \
"""
<b>ISRAEL EXPERIENCE — YOUNG DOCTORS</b>

Программа подготовки к сдаче государственного экзамена на получение лицензии врача в Израиле.

8-месячная программа включает в себя полный курс подготовки к экзамену, курс иврита, дополнительное неформальное образование, документальное сопровождение.

Курс подготовки к экзамену проходит на базе медицинского центра «Рамбам» — крупнейшего медицинского центра на севере Израиля. Преподавателями программы являются практикующие врачи и профессора университета «Технион».
 • Занятия проходят 5 дней в неделю, с воскресенья по четверг, по 5 учебных часов в день;
 • Обучение и промежуточные экзамены проходят на русском языке, часть учебных материалов на английском языке;
 • После прохождения каждой темы учащиеся сдают тренировочные экзамены;
 • На протяжении всей учебы можно бесплатно пользоваться научной библиотекой;
 • Мы также берем на себя документальное сопровождение и частичную организацию перевода документов для допуска к экзамену.

<i>Экзамен на лицензию</i>
Государственный экзамен на получение лицензии проходит два раза в году.
Экзамен состоит из 220 вопросов по пяти основным разделам: терапия, психиатрия, педиатрия, хирургия, гинекология/акушерство. Он построен по американской системе, представляющей собой тест с вопросами и 4-5 вариантами ответа, из которых нужно выбрать лишь один верный в ограниченное время. Экзамен делится на две части – по 110 вопросов в каждой. На прохождение каждой части отведено по 2 часа 15 минут, т.е. порядка 1.2 минуты на каждый вопрос.
Между двумя частями экзамена есть небольшой перерыв.
Процент сдачи экзамена нашими участниками составляет 85-89%!

<i>Где проходит программа</i>
Обучение проходит на базе одного из крупнейших в Израиле медицинских и научно-исследовательских центров «Рамбам» в Хайфе. Это крупнейшая больница региона, обслуживающая израильских граждан и туристов, приехавших в Израиль на лечение.

<i>Условия проживания</i>
Участники программы живут в квартирах в Хайфе, 1-2 человека в комнате.Семейные пары живут в отдельных семейных квартирах.

<i>Участие супругов не врачей</i>
В программе могут принимать участие также мужья и жены — не врачи (до 34 лет), которым мы предоставляем курс иврита и стажировку (аналог программы «Мастер+Статус»).
Программа для мужей и жен начинается одновременно с программой «Молодые врачи», но длится 7 месяцев, а не 8! Участникам необходимо будет доплатить разницу за последний месяц.
Семейные пары проживают в отдельных семейных квартирах.

Подробнее о программе: http://israelxp.tilda.ws/youngdoctors
"""

progXPDentists = \
"""
<b>ISRAEL EXPERIENCE — YOUNG DENTISTS</b>

В основе 6-месячной программы — подготовка к сдаче госэкзамена на получение израильской лицензии и полный курс иврита со сдачей экзамена на уровень владения языком.
Курс подготовки к практической части построен в соответствии с требованиями Минздрава Израиля и читается на русском языке. Программа проходит в Раанане, в самом центре страны.
Кроме этого, в состав программы входит полное документальное сопровождение и ороганизация перевода документов, а также экскурсии, культурные мероприятия и дополнительное неформальное образование.

<i>Экзамены на лицензию</i>
Государственный экзамен проходит 2 раза в год и состоит из двух частей: теоретической и практической. Теоретическая часть проводится письменно и включает в себя 180 вопросов.
Практическая часть определяет наличие профессиональных навыков: умение поставить пломбу, сделать рентген и т.д.

После успешного прохождения теоретической части, экзаменуемый допускается к практической. Если же практическая часть пройдена неудовлетворительно, достаточно пересдать только ее.
Практическую часть экзамена можно сдавать в течение двух лет после успешной сдачи теоретической части.
Результат экзамена действителен в течение двух лет.

<i>Условия проживания</i>
Программа проходит в Раанане, в центре страны. Участники программы живут в центре абсорбции. Семейные пары живут в отдельных семейных квартирах.

Во всех квартирах, оборудованных отдельной кухней и ванной комнатой, есть кондиционеры или вентиляторы и безлимитный Wi-Fi.

Мы предоставляем постельное белье и посуду — все необходимое для комфортного проживания с первого дня заезда.

<i>Участие супругов не стоматологов</i>
В программе могут принимать участие также мужья и жены — не стоматологи, которым мы предоставляем курс иврита, стажировку или курс подготовки "Начало профессионального пути в Израиле" (аналог программы «Мастер+Статус»).
Семейные пары проживают в отдельных семейных квартирах.

Подробнее о программе: http://israelxp.tilda.ws/dentists
"""

progCulinaryArt = \
"""
<b>TLALIM — CULINARY ART</b>

Приготовление еды появилось так же давно, как и само человечество. Кулинарное искусство сегодня — хорошо оплачиваемая специальность и предмет международных конкурсов. Мастерство создания красивой и вкусной еды нуждается в тренировке и постоянном совершенствовании, ведь одного только врожденного таланта недостаточно, чтобы стать профессионалом.
Компания «Тлалим» совместно с университетом имени Бен-Гуриона в Эйлате и сетями отелей «Fattal» и «Isrotel» приглашает на программу <u>«Culinary Art»</u>.
Маса от компании «Тлалим» предлагает в программе <u>«Culinary Art»</u> в Эйлате раскрыть таланты, получить профессиональные навыки и опыт, ощутить вкус успеха. Программа дает базу международной французской кухни, знакомство с различными школами мира и Израилем.

Компания «Тлалим» предоставляет участникам профессиональные знания, карьерные перспективы и великолепное времяпрепровождение.
Программа объединяет обучение востребованной профессии и профессиональную практику с возможностью путешествовать по Израилю и узнать страну, знакомства с наследием и культурой Израиля и еврейского народа, изучения иврит, волонтерской деятельности и социализацией в стране. 

<i>Уникальные компоненты программы</i>:
 • Обучение проходит на русском языке в международной «Школе гостиничного дела и туризма при университете им. Бен-Гуриона» в Эйлате;
 • В рамках программы студенты изучают теорию и практику кулинарного искусства — 336 часов;
 • Занятия проводят дипломированные шеф-повара;
 • Участники получают в подарок личный поварской инвентарь и поварскую обувь в конце программы;
 • Участникам, окончившим курс «Кулинарного искусства» в Эйлате, выдается сертификат;
 • Поварская практика в крупнейших отелях Эйлата.


Подробнее о программе: https://ru.tlalimgroup.com/culinaria-masa/

Дополнительная информация:
 • Координатор программы: Светлана Айзнер
 • Tel.: +972-58-470-8688
 • svetlanaa@authenticisrael.com
"""

progTlalimDigitalDesign = \
"""
<b>TLALIM — DIGITAL DESIGN</b>

Количество желающих открыть свой собственный сайт с уникальным дизайном увеличивается с каждым годом, и уже давно стерты границы в искусстве его создания – его графического оформления, всевозможных спецэффектов, поэтому в мире появилась востребованная профессия Digital-дизайнера.

<u>Digital Design</u> — это создание дизайна сайтов и приложений, включающее в себя и графический интерфейс загружаемых страниц, и разработку навигационной системы, и информационное наполнение. Овладев данной профессией на нашей программе, будущий digital-дизайнер обеспечен интереснейшей работой и хорошим заработком. Сочетание теории и практики под руководством профессионального преподавательского состава сделает ваше обучение интересным и эффективным!

Курс составлен для студентов любого уровня подготовки. Программа включает в себя лекции, практические занятия (в соотношении 50/50 относительно всего времени курса), а также индивидуальные консультации с преподавателем в классе и вне учебного пространства.

Основной упор курса делается на развитие творческого мышления, решение задач и изучение дизайна с точки зрения теории и практики. На курсе <u>«Digital Design»</u> не столь важно, в какой программе делается задание, а рассматривается процесс и результат работы. Для более эффективной и быстрой коммуникации в группе, вначале года создается общий чат группы для анонсов заданий, консультаций и обмена информацией.

Подробнее о программе: https://ru.tlalimgroup.com/design-masa/

Координатор программы: Светлана Борисова
 • Tel.: +972-52-268-6657
 • svetlana@tlalimgroup.com
"""

progTlalimSurfing = \
"""
<b>TLALIM — EXTREME SURFING</b>

Программа <u>«EXTREME SURFING»</u> проходит в главном туристическом городе Израиля — Эйлате. Это удивительное место на берегу залива Красного моря на юге страны. Уникальная природа этого места создает идеальные условия для занятий экстремальными видами морского спорта. Горное ущелье, пустыня, теплое и гладкое море с постоянной теплой температурой сделали этот курорт одним из лучших мест для занятий виндсерфингом, кайтсерфингом и SUP.

<i>Windsurfing</i> занимает особое место в сердце любителей экстремального морского спорта и стал главным спортивным занятием на пляжах Эйлата. Скольжение по морской глади с парусом под ярким солнцем не оставит никого равнодушным.
<i>Kitesurfing</i> — морской спорт, завоевавший Америку и Австралию, добрался до Израиля и захватил побережье Эйлата. Это направление покоряет сердце любителей экстремального спорта. В скольжении на серфинговой доске при помощи парашюта, в отличии от классического серфинга или морских лыж, границей становится только небо.
<i>SUP (stand-up paddle boarding)</i> – гребля на доске с веслом — мировой хит. Только человек, море, горы, доска и весло.
Так же студенты знакомятся с новыми направлениям в международном спорте: <i>Wingsurfing</i> — доска и крыло и <i>Kayak</i> — каяк и весло.

Программа подходит для новичков в морском спорте.

Компания «Тлалим» предоставляет участникам программы профессиональные знания, 6 месяцев на берегу Красного моря и время на спорт, который близок душе. Маса объединяет обучение, профессиональную практику с путешествиями, знакомством с наследием и культурой Израиля и еврейского народа, изучение иврит, волонтерскую деятельность и знакомства с израильской молодежью.

Подробнее о программе: https://ru.tlalimgroup.com/serfing-masa/

Дополнительная информация:
 • Координатор программ: Тали Балан
 • Tel.: +972-54-974-1234
 • Telegram: @Tali_Balan
 • talib@authenticisrael.com
"""

progTlalimGroup = \
"""
<b>TLALIM — GROUP FACILITATION</b>

Программа <u>«Group Facilitation»</u> от компании «Тлалим» предоставляет углубленное изучение и практику в области ведения групп.
Курс позволяет глубже понять взаимодействие и коммуникацию между людьми, раскрыть собственные аспекты личности, развить эмоциональный интеллект, овладеть практическими инструментами ведущего. Программа предусматривает углубленное изучение групповых процессов, методики ведения групп, работу с конфликтами, проектную практика в области ведения групп. Курс включает в себя разбор тем от этапов развития групп до разбора инструментов танцевальной и музыкотерапии.
Программа подходит для людей со знаниями или опытом в ведении групп и позволит участникам углубить знания и расширить профессиональный инструментарий.

Группа — универсальное понятие, с которым мы сталкиваемся ежедневно. Человек — социальное существо и для успешного развития ему нужна группа. Взаимодействие с людьми, понимание эмоций группы являются ключевыми навыками для людей многих профессией.

Профессионалы в области ведения групп пользуются большим спросом, так как любую организацию можно рассматривать как группу людей, объединенных общими задачами и целью. Работа в команде — ценный навык который необходим в современных компаниях.

Выпускники программы работают в сферах формального и неформального образования, создали личные проекты для новых репатриантов в Израиле, в еврейских организациях в русскоязычных странах и Израиле, стали HR-менеджерами, психологами, тренерами.

Курс подходит для психологов, HR, педагогов, гидов и других смежных областей, которые в повседневной работе сталкиваются с работой с группами.

Компания «Тлалим» предоставляет участникам программы удивительные возможности: профессиональные знания, карьерные перспективы и великолепное времяпровождение. Студенты объединяют обучение востребованной профессии и профессиональную практику с возможностью путешествовать по Израилю и узнать страну, познакомиться с наследием и культурой Израиля и еврейского народа, изучать иврит, заниматься волонтерской деятельностью и познакомиться с израильской молодежью.

Подробнее о программе: https://ru.tlalimgroup.com/vedenie-masa/

Дополнительная информация:
 • Координатор программ: Тали Балан
 • Tel.: +972-54-974-1234
 • Telegram: @Tali_Balan
 • talib@authenticisrael.com
"""

progTlalimVideo = \
"""
<b>TLALIM — MASA VIDEO PRODUCTION</b>

Программа Маса компании «Тлалим» <u>«Video production»</u> приглашает вывести хобби фото- и видеосъемки на профессиональный уровень.
Цель курса — обучить созданию кинофильмов любого жанра, предпродакшену, продакшену и постпродакшену, а также режиссуре, процессам подготовки к съемке и основам языка кино. 

Программа также включает курс по фотосъемке. Преподаватели откроют профессиональные секреты мастерства, научат работать с ручными настройками. Каждый студент получает внимание учителей и разбирает первые профессиональные снимки и, понимая ошибки, узнает, как усовершенствовать результаты посредством обработки.

Программа подходит для людей без профильного художественного образования, которые заинтересованы овладеть профессией видео-оператора или фотографа.

Подробнее о программе: https://ru.tlalimgroup.com/video/

 Дополнительная информация:
 • Координатор программы: Елизавета Гиндис
 • Tel.: +972-58-782-0548
 • ElizavetaG@authenticisrael.com
"""

progTlalimMDL = \
"""
<b>TLALIM — MDL: MASA DOCTORS LICENSE IN THE NEGEV</b>

Более 85% наших выпускников успешно сдают государственный экзамен на лицензию врача в Израиле, а пройденный полный курс иврита позволяет им без промедлений приступить к профессиональной практике. Закончив «MASA Doctors License in The Negev», врачи получают возможность поступить в специализированный медицинский ульпан.

Врачи-специалисты из центральной больницы Юга Израиля «Сорока» 8 месяцев готовят студентов к прохождению государственного экзамена на получение израильской лицензии. Данные специалисты 8 месяцев готовят студентов к прохождению государственного экзамена на получение израильской лицензии. Участники программы проходят полный курс ульпана "алеф" и сдают Государственный лицензионный экзамен по завершению.

Программа включает в себя цикл встреч и лекций на базе «Сороки», визиты в больницы Израиля в сопровождении заведующих отделений. На продвинутых этапах обучения в курс включен простроенный план встреч, который позволяет понять методики работы, узнать инструментарий, познакомиться с людьми «внутри» системы.

Программа предназначена для врачей и выпускников медицинских вузов стран СНГ и Балтии в возрасте от 22 до 40 лет.

<i>Компания Тлалим берет на себя оформление документов</i>: перевод и нотариальное заверение документов, необходимых для государственного экзамена, оплата взносов и налогов, необходимых для прохождения государственного экзамена, подвозка в день экзамена. 

<i>Программа представляет возможность участия семейных пар с детьми</i>. На программу принимаются дети с 3-х лет, которые благодаря содействию муниципалитету г. Беер-Шева, зачисляются в сады или школы бесплатно родителей, за исключением регистрационных сборов. Программа включает в семейные экскурсионные выезды. Семейная пара с ребенком получает на время программы подходящее жилье.
Если второй родитель в паре не врач, компания Тлалим предлагаем на выбор участие в программе «Старт» или «Video production» в городе Беер-Шева.

Дополнительная информация:
 • Подробнее о программе: https://ru.tlalimgroup.com/doctors/
 • Координатор программы: Тали Балан
 • Whatsapp: +972-54-974-1234 
 • Email: talib@authenticisrael.com
"""

progTlalimDigitalMarket = \
"""
<b>TLALIM — DIGITAL MARKETING</b>

Еще несколько лет назад интернет-маркетинг казался чем-то новым и необычным, а для многих непонятным термином. Сейчас каждая крупная компания желает иметь в штате интернет-маркетолога, способного эффективно организовывать рекламные кампании, анализировать деятельность конкурентов и способствовать улучшению имиджа бренда в сети.

Курс <u>«DIGITAL MARKETING»</u> включает учебные модули от социальных сетей до поискового маркетинга:
 • Построение посадочных страниц (landing page) на базе ВордПресс и WIX;
 • Построение бизнес-cтраниц в соцсетях Facebook, YouTube, Instagram (работа с настройками, продвижение, аналитика, PPC, настройка кампейнов);
 • Продвижение в Google (строение мотора, аналитика, Search Console и знакомство с Google Analytics. Обучение работе с Google Ads)
 • Знакомство с UX и работа с клиентом;
 • Обучение E-commerce (онлайн-продажи);
 • Знакомство со сферой СЕО (поисковая оптимизация).

<i>Что вас ждет на программе?</i>
 • Полный курс обучения новой специальности с преподавателями, специалистами в различных областях цифрового маркетинга;
 • Общение и возможность получения опыта создателей собственных интернет-площадок, СЕО-специалистов и блогеров с большим опытом работы;
 • Знакомство со специалистами в сфере IT, работающими в ведущих компаниях;
 • Практический опыт и применение цифровой рекламы для вашего бизнеса под руководством профессионалов.

Не упустите свой шанс получить востребованную профессию успешных людей на программе Маса от компании «Тлалим» <u>Digital Marketing</u>!

Программа поможет не только приобрести ведущую профессию, но и пройти стажировку, в одной из hi-tech компаний Израиля, приобрести дополнительный практический опыт, познакомиться с системой работы компании и даже стать частью ее коллектива.

Подробнее о программе: https://ru.tlalimgroup.com/java-masa/

Дополнительная информация:
 • Координатор программы: Светлана Борисова
 • Tel.: +972-52-268-6657
 • svetlana@tlalimgroup.com
"""

progTlalimDivers = \
"""
<b>TLALIM - RED SEA DIVERS</b>

Ничто не сравнится с азартом исследования тайн подводного мира, чувством преодоления законов тяготения и легким скольжением в трех измерениях!  

Красное море — дайверское место паломничества. В прозрачной, теплой от поверхности до самого дна воде видны коралловые сады со стаями разноцветных рыб, затонувшие корабли, крупные морские обитатели — и это происходит не на другом конце земли, а на программе <u>«Red Sea Divers»</u> в Израиле.

Компания «Тлалим» в Эйлате вместе с учебным центром дайвинга «Manta» приглашает на курс помощников инструкторов подводного плавания протяженностью в 7 месяцев.

Программа подходит новичкам и дайверам, которые хотят получить международные сертификаты и право на работу. Курс включает в себя стажировку в области помощников инструкторов дайвинга.

Компания “Тлалим” предоставляет участникам программы профессиональные знания, карьерные перспективы и незабываемое времяпровождение. Студенты объединяют обучение востребованной профессии и профессиональную практику с путешествиями по Израилю, знакомством с наследием и культурой Израиля и еврейского народа, изучение иврита, волонтерство и встречи с израильской молодежью.

Подробнее о программе: https://ru.tlalimgroup.com/diving-masa/

Дополнительная информация:
 • Координатор программ: Тали Балан
 • Tel.: +972-54-974-1234
 • Telegram: @Tali_Balan
 • talib@authenticisrael.com
"""

progTlalimMotion = \
"""
<b>TLALIM — MOTION DESIGN</b>

<u>Моушн-дизайн (Motion Graphics Design)</u> — искусство оживления графики через анимацию — симбиоз графического дизайна и динамической графики, применяемый в фильмах, видео или компьютерной анимации.

Программа обучения компьютерной графике и моушн-дизайну предоставит участникам возможность развить художественные способности и получить широкие познания современных компьютерных технологий, а также научит создавать анимированные ролики на базе полученных знаний в области графического дизайна, изученных компьютерных программ для работы с визуальными и звуковыми эффектами, анимацией и монтажом.

Программа поможет не только приобрести ведущую профессию, но и пройти стажировку, в одной из hi-tech компаний Израиля, приобрести дополнительный практический опыт, познакомиться с системой работы компании и даже стать частью ее коллектива.

Подробнее о программе: https://ru.tlalimgroup.com/java-masa/

Дополнительная информация:
 • Координатор программы: Светлана Борисова
 • Tel.: +972-52-268-6657
 • svetlana@tlalimgroup.com
"""

progTlalimWeb = \
"""
<b>TLALIM — WEB DEVELOPMENT</b>

Full Stack Web Developer — это универсальный программист, который может сам с нуля разработать функциональный продукт. Такой специалист разбирается как в Back-end составляющей (программно-аппаратная часть сервиса), так и во Front-end (интерфейс пользователя).
Fullstack web разработчики востребованы во всех сферах бизнеса. В крупных компаниях они часто занимаются небольшими продуктами, например для внутренней оптимизации. Но могут и руководить командой программистов, так как понимают особенности разных типов разработки. Много fullstack-разработчиков работают на фрилансе, потому что могут решить главную задачу малого бизнеса — быстро разработать сайт с минимальными затратами.

Подробнее о программе: https://ru.tlalimgroup.com/web-masa/

Координатор программы: Светлана Борисова
Tel.: +972-52-268-6657
svetlana@tlalimgroup.com
"""

progTlalimHotel = \
"""
<b>TLALIM — HOTEL ADMINISTRATION</b>

Программа по подготовке специалистов среднего звена гостиничного менеджмента компании «Тлалим» предоставляет Вам возможность получить знания и практику в области гостиничного дела. 
Гостиничный менеджмент — один из самых динамично развивающихся видов деятельности внутри сферы гостеприимства и туризма. Данная область требует приложения сил все большего количества специалистов. Именно поэтому наши выпускники в настоящее время высоко востребованы на рынке труда.

В процессе обучения много внимания уделяется иностранному языку, который весьма важен для будущих гостиничных менеджеров, ведь им придется работать с зарубежными гостями. 
Студенты проходят практику в крупнейших сетях отелей Эйлата, где имеют возможность применить полученные во время обучения навыки.

Подробнее о программе: https://ru.tlalimgroup.com/hotel-masa/

Дополнительная информация:
 • Координатор программы: Светлана Айзнер
 • Tel.: +972-58-470-8688
 • svetlanaa@authenticisrael.com
"""

progTlalimJavaAndroid = \
"""
<b>TLALIM — JAVA ANDROID DEVELOPMENT</b>

Программа предусматривает изучение современного, мощного и популярного объектно-ориентированного языка программирования Java и последующую профессиональную подготовку.
Java — язык программирования, используемый как для создания небольших приложений для Интернета, так и универсальная платформа для создания программного обеспечения от мобильных устройств и смарт-карт до мощных серверов, разработки веб-сайтов, игр, прикладных программ. 
Цель данного курса в первые 3 месяца программы — дать представление и понимание основных свойств, средств и утилит Java, научить студентов разрабатывать приложения для широкого спектра задач, дать основы для дальнейшего изучения Java-технологий.

Программа поможет не только приобрести ведущую профессию, но и пройти стажировку, в одной из известных хай-тэк компаний Израиля, приобрести дополнительный практический опыт, познакомиться с системой работы компании и даже стать частью ее коллектива.

Подробнее о программе: https://ru.tlalimgroup.com/java-masa/

Дополнительная информация:
 • Координатор программы: Светлана Борисова
 • Tel.: +972-52-268-6657
 • svetlana@tlalimgroup.com
"""

progXPHiTech = \
"""
<b>MASA ISRAEL EXPERIENCE — HI-TECH</b>

Программы в сотрудничестве с израильским колледжем Tel Ran. 
Обучение по направлениям на выбор: 
<u>Java Web Mobile</u> или <u>QA Testing</u>.

Образовательные программы построены на базе хайфского филиала учебного центра Tel-Ran — самого известного русскоязычного IT центра в Израиле.
Программы рассчитаны как на участников без профессиональной подготовки в сфере IT, так и для тех, кто уже занимался программированием.
Условием участия в программах является прохождение онлайн-интервью с координатором колледжа (задания на логику, проверка английского языка, мотивация).
Неотъемлемой частью программ является волонтёрство, экскурсии по всей стране, мероприятия, встречи и мастер-классы, а также знакомство с миром IT Израиля. В программы входит также базовое изучение иврита.

<b>Курс Java Web Mobile включает в себя</b>:
 • мощную базу в виде знакомства с объектно-ориентированным программированием и изучения основ языка Java – безусловного лидера современного сектора разработки;
 • востребованное направление профессионального развития как на рынке труда СНГ, так и Израиля: WEB/Mobile – на языке программирования JavaScript + React/Redux;
 • практику — реализацию проекта: работа с ментором, навыки самостоятельной разработки проекта и работы в команде;
 • презентацию проектов по окончании курса, знакомство с представителями IT-компаний Израиля;
 • при желании — практику после окончания программы.

<b>Курс QA Testing включает в себя</b>:
 • блок изучения Java — самого популярного языка программирования;
 • основу профессии — теорию тестирования, ручное и автоматическое тестирование;
 • практику на реальных проектах: работа с ментором, навыки самостоятельной и командной работы;
 • онлайн-курс профессионального английского;
 • курс иврита.

<i>В программе могут принимать участие также мужья и жены — не программисты, возможно участие с детьми и присутствие домашних животных.</i>

Подробнее о программе: http://israelxp.tilda.ws/hitech


<b>MASA E&A</b>

Новая программа в сотрудничестве с Ассоциацией инженеров и архитекторов репатриантов в Израиле — <u>Masa E&A</u>

<i>Курс включает в себя</i>:
 • профессиональное обучение и повышение квалификации в программах проектирования AutoCAD и Revit (интерфейс на англ. языке) на базе авторизированного тренинг-центра Autodesk;
 • подготовка документов для внесения в реестр инженеров и получения лицензии в министерстве труда Израиля;
 • базовый курс иврита;
 • базовый курс профессионального (технического) иврита;
 • создание и защита итогового индивидуального проекта;
 • составление резюме на иврите;
 • консультации по трудоустройству;
 • рекомендации успешных выпускников в компании согласно их квалификации;
 • помощь в репатриации по окончании программы

Неотъемлемой частью программы также является волонтёрство, экскурсии по всей стране, мероприятия, встречи и мастер-классы, а также знакомство с еврейскими традициями и актуалиями Израиля.

<i>В программе могут принимать участие также мужья и жены</i> — не инженеры, которым мы предоставляем курс иврита или стажировку (аналог программы «Мастер+Статус»).
Кроме того, программа позволяет участие с детьми, с возможностью записи в детский сад или школу. Проживание с детьми — также в квартирах-студиях.

Подробнее о программе: http://israelxp.info/masaea
"""

progNitzanaDesert = \
"""
<b>NITZANA — MASA DESERT CHALLENGE</b>

У вас есть возможность провести свои незабываемые, беззаботные 6-8 месяцев в сохнутовском лагере, в котором наряду с изучением иврита на высоком уровне, обучением на профессиональных курсах и многочисленных путешествий по Израилю, вы получите лучшую информационную и практическую подготовку к самостоятельной жизни в Израиле, без головной боли от оформления во всех необходимых инстанциях и бюрократических проволочек. 

<i>Обучение по специальности</i>: 
 • Инструктор тренажерного зала;
 • Диетология;
 • Подготовка к армии;
 • Бьюти-сфера.

Подробнее о программе: https://www.masanitzana.com/

Дополнительная информация:
 • Телефон: +972523463469
 • Instagram: <u>masa_nitzana</u>
 • E-mail: masa.sport.nitzana@gmail.com
"""

progShiltonMaof = \
"""
<b>SHILTON BETAR — MABAT MAOF</b>

<u>Маса Бейтар</u> — это программы для тех, кто хочет попробовать свои силы в самостоятельной жизни в Израиле, приобрести необходимые инструменты и связи для этого, понять страну и происходящие в ней процессы, найти «свое место» в израильской жизни: в учебе, работе, обществе, достигнуть высокого уровня иврита за время программы.

<u>Направление Мабат</u> — программа интенсивного иврита, знакомства с Израилем, идеальная подготовка к репатриации. 

<u>Направление Маоф</u> — для тех, кто хочет быть финансово грамотным и задумывается о частном бизнесе в Израиле.

Программа оплачивает:
 • Проживание в Иерусалиме в квартирах;
 • Медицинская страховка;
 • Интенсивный иврит(5 р/нед 5 ак.ч.);
 • Ежемесячный безлимитный проездной;
 • Стипендия 1800$ за 6 месячную программу (1000 шекелей (300$) ежемесячно);
 • Экскурсии и поездки по Израилю;
 • Курс «Карьеры и учеба в Израиле»;
 • Сопровождение в получении гражданства.
"""

progWayEnglish = \
"""
<b>ISRAEL WAY — ENGLISH IN THE CITY</b>

Программа <u>«English in the city»</u> даёт её участникам возможность изучать английский язык и немедленно применять свои знания в языковой среде самого крупного и динамичного израильского мегаполиса — Тель Авива.

Обучение начинается с начального уровня, что позволяет создать однородную среду и небольшие учебные классы. Уже после нескольких месяцев обучения, участники получают достаточный объем знаний и опыта, чтобы чувствовать себя уверенно в общении с носителями языка. 
Пятимесячный курс позволяет овладеть разговорными и письменными навыками, получить ценный опыт общения и погружения в языковую среду, одновременно получая удовольствие от жизни в самом современном и динамичном городе Израиля.

Кроме того, программа предполагает интеграцию участников в жизнь города и страны: они будут посещать экскурсии и культурные мероприятия, участвовать в волонтерских проектах, изучать азы иврита.
"""

progWayHebrew = \
"""
<b>ISRAEL WAY — HEBREW IN THE CITY</b>

Программа <u>«Hebrew in the city»</u> даёт участникам возможность углублённо изучать иврит и немедленно применять свои знания в языковой среде самого крупного и динамичного израильского мегаполиса — Тель Авива.

Перед началом учёбы участники проходят распределение по группам, которое основанное на уровне знания языка, что позволяет создать однородную среду и сформировать небольшие учебные классы. Уже после нескольких месяцев обучения, участники получают достаточный объем знаний и опыта, чтобы чувствовать себя уверенно в общении с израильтянами. Пятимесячный курс позволяет овладеть разговорными и письменными навыками, получить ценный опыт общения и погружения в языковую среду, одновременно получая удовольствие от жизни в самом современном и динамичном городе Израиля.

Кроме того, программа предполагает интеграцию участников в жизнь города и страны, путем посещения экскурсий и культурных мероприятий. Дополнительно к изучению иврита, участники получат возможность познакомиться с Израилем.
"""

progTlalimPharmacist = \
"""
<b>TLALIM — BE A PHARMACIST IN ISRAEL</b>

<u>Программа «Be a pharmacist in Israel»</u> от компании «Тлалим» предназначена для провизоров-выпускников медицинских вузов стран СНГ и Балтии и для специалистов с опытом работы в профессии.

Программа Маса для провизоров стартует в 2023 году впервые. Программа предназначена для специалистов 2 категорий:
 • Провизоры с высшим образованием и без опыта работы;
 • Провизоры с высшим образованием и со стажем работы в аптеках от двух лет.

<u>Программа «Be a Pharmacist in Israel»</u> делает упор на подготовку участников к экзамену на получение лицензии и изучение иврита, знакомит участников с миром фармацевтики в Израиле: с аптеками, больничными кассами и включает стажировку в аптеках для знакомства с работой в сфере. Мы сопровождаем студентов на протяжении всего процесса согласования документов с Министерством Здравоохранения.

*Провизор, не получивший лицензию, не имеет права вести профессиональную практику в Израиле.

Программа включает в себя:
 • Подготовка провизоров к сдаче экзамена;
 • Полный курс иврита ульпана “алеф” и сдача Государственного лицензионного экзамена по завершению;
 • Стажировка в аптеках Израиля в рамках курса ставит задачи дать опыт и понимание мира фармации в Израиле;
 • 2 профессиональные экскурсии.

Программа проводится в партнерстве с больничной кассой «Леумит», в рамках которой происходит знакомство с системой работы больничных касс и стажировка на курсе.

<i>Компания «Тлалим» берет на себя оформление документов</i>: перевод и нотариальное заверение документов, необходимых для государственного экзамена, сопровождает в процессе получения признания обучения и предыдущего опыта Министерством Здравоохранения, а также инструктаж участников о путях и сроках оплаты личного участия для сдачи экзамена на профессиональную лицензию провизора в Израиле.

*Программа готова рассмотреть возможность участия семейных пар с детьми от 3х лет. Если второй родитель в паре не врач, компания «Тлалим» предлагает участие в программе «Старт» в городе Беер-Шева.

Подробнее о программе: https://ru.tlalimgroup.com/pharmacist/>

Дополнительная информация:
 • Координатор программ: Тали Балан
 • Телефон: +972-54-974-1234
 • Telegram: @Tali_Balan
 • E-Mail: talib@authenticisrael.com
"""
progMasaTech = \
"""
<b>MASATECH</b>

<u>MasaTech</u> — это самая элитная израильская программа по рекрутингу лучших кандидатов со всего мира для работы в ведущих хай-тек компаниях.
Израиль — хай-тек столица Ближнего востока, старт-ап нация со всемирно признанными исследованиями и разработками. Это место, куда компании обращаются за творчеством, инновациями и ростом.
Сегодня Израиль может похвастаться множеством хай-тек компаний в различных областях. От биотехнологии до кибербезопасности и программного обеспечения. Мощный сектор высоких технологий Израиля предоставляет новые и захватывающие профессиональные возможности. 
Старт-ап работа гарантированно поднимет твою карьеру на новый уровень.

Партнеры MasaTech ищут программистов с опытом работы в Frontend, Backend, Full Stack, Mobile Development, DevOps, RT Embedded, Machine Learning, Image Processing, Big Data, UX.

<i>Что мы предлагаем?</i>
 • Не менее 10 месяцев гарантированной полной занятости;
 • Конкурентоспособную зарплату и льготы;
 • Рабочую визу на срок действия программы с возможностью продления до 4-х лет;
 • Непревзойденный социальный и культурный опыт жизни в Израиле;
 • Работу на английском языке в Израиле;
 • Эксклюзивный нетворкинг.
"""

progMasaRemote = \
"""
<b>TLALIM — REMOTE ISRAEL TLV</b>

Программа <u>«Remote Israel — Tel-Aviv»</u> предлагает вам невероятный шанс присоединиться к участникам проекта Маsа в Израиле, не отказываясь от своей работы!
В связи с пандемией в мире происходят не только изменения, но и открываются новые возможности. Все больше людей стали работать удаленно, а путешествия стали редкостью.
Проект Маса и компания Тлалим развиваются и создают новые горизонты для Вас. 

В рамках <u>«Remote Israel — Tel-Aviv»</u> мы предлагаем уникальную возможность совместить дистанционную работу и опыт жизни в Израиле.
Программа построена таким образом, что позволяет совместить полную рабочую неделю или работу на фрилансе с релокацией в рамках Масы.
Мы предлагаем Вам прожить 4 незабываемых месяца в самом центре Тель-Авива в израильской жизни, сохранив удобный темп вашей работы.
Экскурсии, лекции. семинары проводятся на программе по воскресениям, занятия ивритом- в понедельник-среду по вечерам (2 часа), общегрупповая встреча 1 раз в неделю — вторник или четверг (вечером)

Подробнее о программе: https://ru.tlalimgroup.com/remote/

Дополнительная информация:
 • Координатор программ: Тали Балан
 • Tel.: +972-54-974-1234
 • Telegram: @Tali_Balan
 • talib@authenticisrael.com
"""

progHelper = \
"""
<b>Совсем не понимаешь, какую программу выбрать?</b>

Наш заботливый координатор русскоязычных программ с удовольствием ответит на все вопросы и поможет принять правильное решение.
<a href='https://calendly.com/masainforus'>Закажи звонок</a> прямо сейчас, чтобы получить консультацию!

Также можно проконсультироваться по электронной почте: masainforus@masaisrael.org
"""



# --------------------------------------MAIN DICTIONARY--------------------------------------
"""
  function that creates a texts dictionary which loads the texts into memory as needed using lambdas
  you need to call() the element later in code in order to get the text itself, else you will just get the lambda function's object returned
"""
def generate_texts_dictionary():
  # Get all the variables defined in the module
  variables = {name: (lambda value=value: value) for name, value in globals().items()
               if not name.startswith("__") and not callable(value)}
  return variables

# Call the function to generate the texts_dictionary
prog_texts = generate_texts_dictionary()
prog_texts["None"] = lambda: programmeMessage


prog_data = {
  "progOranimPreMA": ["Oranim - Pre M.A.", "masaoranim@oranim.ac.il"],
  "progArielBA": ["Ariel University - B.A.", "masa@ariel.ac.il"],
  "progArielMA": ["Ariel University - M.A.", "masa@ariel.ac.il"],
  "progArielResearch": ["Ariel University - Research", "masa@ariel.ac.il"],
  "progOranimEnglish": ["Masa Oranim - English for the Workplace", "masaoranim@oranim.ac.il"],
  "progOranimATI": ["Oranim - A.T.I. Intensive", "masaoranim@oranim.ac.il"],
  "progShiltonMedia": ["Shilton Betar - Media", "masachama@betar.org.il"],
  "progWayCareer": ["Israel Way - Career Growth", ""], # TODO: find the email address
  "progTlalimStart": ["Tlalim - Start", "talib@authenticisrael.com"],
  "progXPMaster": ["Masa Israel XP - Master plus Status", ""], # TODO: find the email address
  "progSachlavTop": ["Masa Sachlav - Top Israel Interns", ""], # TODO: find the email address
  "progWayMelamedia": ["Israel Way - Melamedia", "team@israelway.ru"],
  "progWayWeb": ["Israel Way - Web/Graphic Design", ""], # TODO: find the email address
  "progSachlavOfek": ["Sachlav - Ofek", ""], # TODO: find the email address
  "progXPDoctors": ["Masa Israel XP - Young Doctors", ""], # TODO: find the email address
  "progXPDentists": ["Masa Israel XP - Young Dentists", ""], # TODO: find the email address
  "progCulinaryArt": ["Tlalim - Culinary Art", "svetlanaa@authenticisrael.com"],
  "progTlalimDigitalDesign": ["Tlalim - Digital Design", "svetlana@tlalimgroup.com"],
  "progTlalimSurfing": ["Tlalim - Extreme Surfing", "talib@authenticisrael.com"],
  "progTlalimGroup": ["Tlalim - Group Facilitation", "talib@authenticisrael.com"],
  "progTlalimVideo": ["Tlalim - Video Production", "ElizavetaG@authenticisrael.com"],
  "progTlalimMDL": ["Tlalim - MDL: Masa Doctors License", "talib@authenticisrael.com"],
  "progTlalimDigitalMarket": ["Tlalim - Digital Marketing", "svetlana@tlalimgroup.com"],
  "progTlalimDivers": ["Tlalim - Red Sea Divers", "talib@authenticisrael.com"],
  "progTlalimMotion": ["Tlalim - Motion Design", "svetlana@tlalimgroup.com"],
  "progTlalimWeb": ["Tlalim - WEB Development", "svetlana@tlalimgroup.com"],
  "progTlalimHotel": ["Tlalim - Hotel Administration", "svetlanaa@authenticisrael.com"],
  "progTlalimJavaAndroid": ["Tlalim - JAVA ANDROID Development", "svetlana@tlalimgroup.com"],
  "progXPHiTech": ["Masa Israel XP - Hi-Tech", ""], # TODO: find the email address
  "progNitzanaDesert": ["Nitzana - Masa Desert Challange", "masa.sport.nitzana@gmail.com"],
  "progShiltonMaof": ["Shilton Betar - Mabat Maof", "masachama@betar.org.il"],
  "progWayEnglish": ["Israel Way - English in the City", ""], # TODO: find the email address
  "progWayHebrew": ["Israel Way - Hebrew in the City", ""], # TODO: find the email address
  "progTlalimPharmacist": ["Masa Tlalim - Pharmacist in Israel", "talib@authenticisrael.com"],
  "progMasaTech": ["MasaTech", ""], # TODO: find the email address
  "progXPHiTech": ["Masa Israel XP - Hi-Tech", ""], # TODO: find the email address
  "progMasaRemote": ["Masa Remote", "talib@authenticisrael.com"]
}
